EnKF-Training-codes/foam_base/case2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "2000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
39402
(
(300.43 5.81129 0)
(57.3174 0.0588995 0)
(583.707 16.5003 0)
(34.2803 0.014102 0)
(160.795 0.202425 0)
(772.858 27.057 0)
(31.918 0.000240295 0)
(98.8948 0.0708763 0)
...
)
;

boundaryField
{
    base
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (1484 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            fixedValue;
        value           uniform (1484 0 0);
    }
}


// ************************************************************************* //
