EnKF-Training-codes/foam_base/case2/0/Mg
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      Mg;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.0033547
0.000217845
0.0043301
6.68418e-05
0.000438545
0.00317608
4.40752e-05
0.000141279
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
1.58391e-09
2.46778e-10
1.22007e-10
9.61748e-11
1.02176e-10
1.09992e-10
1.15037e-10
1.18334e-10
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
9.93094e-23
2.9168e-22
9.62585e-22
2.35865e-21
5.33661e-21
3.81243e-21
9.23465e-21
2.13728e-21
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.0254846
0.0376485
0.0552771
0.0425181
0.0440386
0.0440734
0.0447374
0.0446485
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
5.97811e-22
3.60814e-22
1.22184e-21
4.02354e-21
2.43082e-21
1.68125e-21
3.90692e-21
4.14035e-21
...
)
;
    }
}


// ************************************************************************* //
