EnKF-Training-codes/foam_base/case2/0/TuM
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      TuM;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.164986
0.038205
0.0740948
0.023213
0.0156356
0.0449312
0.0193233
0.00919582
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
4.1074e-08
4.1074e-08
4.1074e-08
4.1074e-08
4.1074e-08
4.1074e-08
4.1074e-08
4.1074e-08
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0.152145;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
0.144775
0.187576
0.205261
0.205072
0.207225
0.207421
0.20922
0.209672
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 0.152145;
    }
}


// ************************************************************************* //
