EnKF-Training-codes/foam_base/case2/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
2.08362e-06
6.90607e-08
1.73798e-06
2.01141e-08
6.91948e-08
1.09632e-06
1.69842e-08
1.90996e-08
...
)
;

boundaryField
{
    base
    {
        type            nutkWallFunction;
        blending        stepwise;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 
398
(
0
0
0
0
0
0
0
0
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 3e-07;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            calculated;
        value           uniform 3e-07;
    }
}


// ************************************************************************* //
