EnKF-Training-codes/foam_base/case2/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
1.09856e+09
1.34117e+09
2.82473e+08
1.6495e+09
2.48042e+08
1.58248e+08
1.71459e+09
2.91811e+08
...
)
;

boundaryField
{
    base
    {
        type            omegaWallFunction;
        blending        binomial2;
        n               2;
        beta1           0.075;
        value           nonuniform List<scalar> 
398
(
1.09856e+09
1.34117e+09
1.6495e+09
1.71459e+09
1.76401e+09
1.77612e+09
1.77399e+09
1.77673e+09
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 1e+09;
    }
    outlet
    {
        type            zeroGradient;
    }
    top
    {
        type            fixedValue;
        value           uniform 1e+09;
    }
}


// ************************************************************************* //
