EnKF-Training-codes/foam_base/case2/0/q3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "2000";
    object      q3;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   nonuniform List<scalar> 
39402
(
0.00754178
0.00200149
0.00998657
0.00104592
0.00223829
0.0103973
0.000837242
0.00114786
...
)
;

boundaryField
{
    base
    {
        type            calculated;
        value           nonuniform List<scalar> 
398
(
5.79448e-19
4.70844e-19
3.90188e-19
3.7242e-19
3.60981e-19
3.58159e-19
3.5895e-19
3.60564e-19
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 2;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
99
(
2
2
2
2
2
2
2
2
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 2;
    }
}


// ************************************************************************* //
